export const resultData = {
  ENFJ: {
    src: `/img/result/ENFJ.png`,
    title: '선을 위해 노력하는 사제',
    sub: '올바른 일에 누군가는 앞장 서야 해요.',
    desc: `
    당신을 대표하는 단어는 '인류애와 조화'입니다.
    아름다운 세상과 평화를 추구하는 당신은
    항상 많은 사람들의 이야기에 귀를 기울입니다.

    타인의 일이어도 부당하거나 옳지 못한 것이라면
    자신의 일처럼 돕는 따뜻한 마음을 가졌습니다.

    다른 사람의 언행을 바꾸는 것은 쉽지 않지만
    사람의 장점을 잘 찾는 눈과 부드러운 리더십으로
    많은 사람들이 당신을 따르고, 지지하는군요.

    하지만 당신의 선함이 누군가에겐 불편하기도 하고,
    지나친 감정이입으로 힘들어지는 일도 있기 때문에
    때로는 충분히 쉬고 자신을 돌봐야 합니다.
    당신이 추구하는 세상과 어린 양을 위해서라도!

    `,
  },
  ENFP: {
    src: `/img/result/ENFP.png`,
    title: '숲속의 명랑한 엘프',
    sub: '즐거운 이 세계, 모든 게 궁금해!',
    desc: `
    당신을 대표하는 단어는 '낙관'입니다.
    활기차고 낙관적인 태도와 재치 있는 언변까지,
    통통 튀는 매력으로 사람들의 시선을 사로잡아요.

    당신은 새로운 것에 대한 두려움이 없는 편이에요.
    새로운 공간, 새로운 사람 다 신선한 자극이거든요.
    그렇기에 이리저리 자유롭게 돌아다니면서
    다양한 사람들을 만나 금방 친구가 되곤 해요.

    당신의 친화력과 솔직하고 당당한 매력은
    사람들의 이목을 끌고, 친구가 되고 싶게 만들죠.
    가끔 조금 부담스럽다는 사람도 있지만요.

    하지만 당신의 말과 행동에는 나쁜 뜻이 없어요!
    그저 친구가 되면 재미 있겠다는 뜻 뿐이니까요.
    '너 내 동료... 친구가 될래?' 라고 말하는 것처럼요.
    
    `,
  },
  ENTJ: {
    src: `/img/result/ENTJ.png`,
    title: '믿음직스러운 리더, 보안관',
    sub: 'born to be Leader!',
    desc: `
    당신을 대표하는 단어는 '카리스마'입니다.
    사람들을 압도하는 자신감과 그에 걸맞는 능력으로
    자신이 원하는 것을 쟁취하고, 자신의 것을 지킵니다.

    당신은 목표와 효율을 가장 중요하게 생각하기에
    무능하고 비효율적인 것을 보면 거침없이 비판합니다.
    그래서 당신은 오만하다고 평가 받기도 하고,
    사람들이 당신의 곁을 떠날 수도 있습니다.

    하지만 따라할 수 없는 당신의 카리스마와 추진력,
    비난이 아닌 애정 어린 '비판'이라는 점을 주목한다면
    누구도 당신을 따르지 않을 수 없을 거예요.
    
    더 나은 사람이 되기 위해 끊임없이 도전하고
    더 멋진 '내'가 됐을 때 만족하는 당신은
    내 편일 때도, 남의 편일 때도 멋져요!

    `,
  },
  ENTP: {
    src: `/img/result/ENTP.png`,
    title: '혁명을 꿈꾸는 마검사',
    sub: '가시밭길에도 신념을 지켜야 해요.',
    desc: `
    당신을 대표하는 단어는 '자신감'입니다.
    특유의 능글거리면서 경쾌한 성격과 빠른 적응력,
    비판과 논란을 두려워 않는 강강약약 스타일이에요.
    
    당신은 오래된 전통이라도 비합리적, 비효율적이라면
    남들이 뭐라 하든 화끈하게 뒤집어 엎어버려요.
    이런 혁명가적 기질에 자신감과 능력이 뒷받침 되어
    토론 자체를 즐기고, 결론적으로 좋은 성과를 내죠.

    그래서 감정에 호소하거나 군중심리, 권위주의 등
    비논리적인 과정이나 체제가 답답하게 느껴집니다.
    따라서 분야에 따라 사회생활이 극과 극일 수 있어요.

    하지만 당신은 늘 근거 있는 자신감을 가져요.
    논리적인 반박은 쿨하게 받아들이며 소신을 지키죠.
    그런 모습이 많은 사람들에게 호감을 산답니다!

    `,
  },
  ESFJ: {
    src: `/img/result/ESFJ.png`,
    title: '백작가의 아가씨/도련님',
    sub: '인생은 기브 앤 테이크예요.',
    desc: `
    당신을 대표하는 단어는 '배려'입니다.
    기본적으로 사람에게 관심이 많고 친절해요.
    사회성이 풍부해 협력도 잘하고 사교적이에요.

    타인과 있을 때 분위기를 편안하게 해주는 편으로,
    스몰 토크에 능하고 공감 능력이 높아 리액션이 좋죠.
    그래서 사람을 부드럽게 다루고 잘 이끄는 편이에요.
    즉, 천성적으로 눈치가 빠르고 사회생활을 잘해요.

    하지만 불화나 갈등을 싫어해 싫은 소리를 잘 못하고,
    당신이 배려한 만큼의 반도 돌아오지 않는다면
    쉽게 마음에 상처를 받고 흑화하기도 합니다.
    적어도 같이 배려하는 마음은 가져야죠!

    그럼에도 자신이 베푼 선의를 알아주는 이들을 위해
    오늘도 따뜻하고 살뜰하게 주변을 챙기는 당신,
    누구보다도 다정하고 능동적인 사람이네요!
    `,
  },
  ESFP: {
    src: `/img/result/ESFP.png`,
    title: '천생 연예인, 매력적인 무희',
    sub: '인생은 매 순간 즐겨야 해요!',
    desc: `    
    당신을 대표하는 단어는 '분위기 메이커'입니다.
    지루하고 반복되는 일상을 제일 싫어하는 당신은
    어딜 가나 주목을 받는 분위기 메이커예요.

    하루하루 즐겁게 살기 위해 거침없이 도전하고,
    세상의 편견 없이 사물이나 사람을 바라보는
    당신의 시각과 사고는 정말 매력적이에요.

    다만 우울한 분위기를 많이 어려워 하고
    가끔 지나치게 충동적인 행동을 해서
    가벼워 보인다는 오해를 받기도 해요.

    하지만 인생은 하나의 스테이지 아니겠어요?
    먼 미래와 해결되지 않는 문제를 걱정하기보다
    지금 당장의 행복과 즐거움을 만끽하는 것이
    당신에겐 더 가치 있는 일이니까요!

`,
  },
  ESTJ: {
    src: `/img/result/ESTJ.png`,
    title: '마법진 수석 디자이너',
    sub: '첫째도 꼼꼼, 둘째도 꼼꼼!',
    desc: `
    당신을 대표하는 단어는 '상식'입니다.
    근면성실, 질서정연도 당신을 대표하는 단어예요.
    규칙만 준수하면 모두가 편해지는데 말이에요.

    당신은 불확실한 미래의 가능성을 찾기보다
    흔들리지 않는 지금 당장의 사실을 추구합니다.
    그렇기 때문에 뜬구름 잡는 소리는 하지 않죠.
    그런 말 할 시간에 한 번 더 체크하는 게 나아요.

    작은 실수는 이해해도 반복되는 실수는 참을 수 없고,
    일 잘해도 나태하고 건방진 건 용납할 수 없어요.
    우리 최소한의 예의와 상식만 지키면 된다니까요?

    당신의 아랫사람이나 주변 사람들은 피곤하겠지만,
    완벽한 원 사이 찌그러진 원이 있으면 불편하잖아요.
    '수석' 디자이너니까 빡센 건 어쩔 수 없어요.

    `,
  },
  ESTP: {
    src: `/img/result/ESTP.png`,
    title: '백발백중 명궁수',
    sub: '피할 수 없다면 즐겨라!',
    desc: `
    당신을 대표하는 단어는 '폼'입니다.
    한 마디로 폼에 죽고 폼에 사는 멋쟁이죠.
    씬 스틸러 내지는 주인공으로 삶을 즐기며 살아요.

    고민은 최대한 짧게, 행동은 최대한 빨리!
    복잡한 생각보다 일단 행동하고 보는 행동파로,
    그 과정에서 만나는 고난마저 스릴 있게 즐겨요.

    화끈한 성격 덕에 문제 해결력이 뛰어난 해결사지만,
    동시에 너무 자유롭게 생각하고 위험한 짓도 잘 해서
    주변 사람들로부터 말썽꾸러기 취급을 받기도 해요.
    
    하지만 인생은 이론이나 책 속에 있는 게 아니라,
    직접 마주하며 만들어 나간다고 생각하는 당신!
    주변 사람들에게도 긍정 에너지를 전파해주네요.
    `,
  },
  INFJ: {
    src: `/img/result/INFJ.png`,
    title: '지혜롭고 신비로운 점술사',
    sub: '가끔은 오래 지켜봐야 해요.',
    desc: `
    당신을 대표하는 단어는 '생각'입니다.
    한 마디로 당신은 생각이 아주 많은 사람이에요.
    인내심이 많으며 항상 신중하게 생각하고 행동하죠.

    기본적으로 말 수가 적고, 상상력이 풍부해요.
    공감능력이 높고 항상 체계적으로 사고합니다.
    온화해 보이지만 선을 넘으면 칼같이 냉정해지고,
    가까운 듯 하다가도 쉽게 거리를 둬 친해지기 어렵죠.

    선과 악, 삶과 죽음 등 추상적인 것에 관심이 많고
    나이에 비해 어른스러워 애늙은이라고 불리기도 해요.
    또 자신만의 신념과 뚜렷해 고집이 센 편이며,
    생각이 매우 많아 꽤 예민한 성격이에요.

    하지만 그만큼 섬세하고 통찰력이 좋아
    늘 여러 각도로 사람들의 고민을 잘 들어줘요.
    떄문에 특유의 신비한 매력을 가지고 있고,
    사람들에게 정신적인 지주로 인지되고 있답니다!
    `,
  },
  INFP: {
    src: `/img/result/INFP.png`,
    title: '낭만의 대명사, 음유시인',
    sub: '이상향을 찾아 떠나요.',
    desc: `
    당신을 대표하는 단어는 '감성'입니다.
    다른 사람들보다 감수성이 풍부한 당신은
    특히 예술 분야에서 뛰어난 재능을 갖고 있어요.

    작은 일에도 어떤 의미와 가치를 두고 살아가며,
    상상력을 기반으로 자신만의 세계를 만들어가요.
    이 세계에는 누구도 쉽게 들어올 수 없지만요!
    
    때론 지나치게 감성적이라 작은 일에도 상처받고
    현실에 부딪혀 쉽게 우울감을 느끼기도 하지만
    그렇기에 타인과 세계를 더 섬세하게 대합니다.

    언뜻 보기에 조용하고 존재감 없어 보이지만,
    당신의 영향력과 다정함은 음유시인의 노래처럼
    잔잔하고 오래 남아 있을 거예요.
    
    `,
  },
  INTJ: {
    src: `/img/result/INTJ.png`,
    title: '어둠의 대마법사',
    sub: '최고가 되는 것은 언제나 고독하다!',
    desc: `
    당신을 대표하는 단어는 '이성과 논리'입니다.
    합리성과 통찰력을 기반으로 사고하는 당신은
    진리와 깊이 있는 지식을 추구합니다.

    쓸모 없는 공감보다 훨씬 유용한 조언을,
    아부보다 우직한 충언이 더 어울리는 당신은
    본의 아니게 주변 사람에게 상처를 주기도
    또 무리로부터 배척을 받기도 합니다.

    하지만 괜찮아요. 그 사람들은 멍청하니까요!
    멍청한 사람들과 무의미한 시간을 보내느니
    차라리 혼자 내가 좋아하는 것을 하는 게 낫죠.

    타고난 지적 능력과 자신감으로 무장한 당신은
    당신과 대적할 똑똑한 용사를 기다리는
    어둠의 대마법사가 아닐까요?

    `,
  },
  INTP: {
    src: `/img/result/INTP.png`,

    title: '힘을 숨긴 연금술사',
    sub: '생각을 하는 한 외롭지 않아요.',
    desc: `
    당신을 대표하는 단어는 '공상과 상상'입니다.
    호기심이 많아 추상적/이론적인 개념에 관심을 갖고,
    혼자 생각하는 것을 좋아해 이런 저런 상상을 합니다.

    남들은 혼자 있는 게 외롭지 않냐고 하는데 전혀요.
    차분히 생각하는 것만큼 가치 있는 시간이 없답니다.
    덕분에 당신은 늘 합리적이고 분석적이며,
    늘 '왜?'라고 자문자답하는 좋은 습관이 있어요.

    반면 타인을 접할 기회가 적어 사회성이 낮을 수 있고,
    당신의 순수한 호기심은 타인을 불편하게 하곤 해요.
    하지만 한 번 친해지면 의외로 유머러스한 당신,
    의외로 귀여운 행동을 하고 꽤 섬세한 편이에요.
    
    낯가림이 심하고 남들 앞에서 뚝딱거리지만,
    지적 호기심이 강하고 사색을 즐겨하는
    묘한 갭모에를 가지고 있답니다!

    `,
  },
  ISFJ: {
    src: `/img/result/ISFJ.png`,
    title: '이세계의 유능한 궁정 약사',
    sub: '곤란한 일은 언제든 도울게요!',
    desc: `
    당신을 대표하는 단어는 '배려심'입니다.
    온화한 미소와 친절한 성격을 가진 당신은,
    사소한 일이라도 맡은 바 최선을 다하는 사람입니다.

    눈썰미가 좋아 타인의 변화와 반응에 민감하며,
    차분한 태도로 쉽게 사람들의 신뢰감을 삽니다.
    또한 일을 계획적으로 꼼꼼하게 하는 편으로,
    주변 사람들에게 안정감을 주는 조력자입니다.

    특히 타인을 돕고 돌보는 일을 즐거워 하며,
    그 과정에서 보람을 느끼는 이타주의자예요.
    하지만 가끔 지나치게 자기희생적인 행동으로
    속앓이를 하거나 자신을 뒷전으로 여기곤 해요.

    때론 타인의 감정보다 자신의 감정을 표현하며
    자신을 지키고 솔직하게 소통하려고 할 때
    더 나은 당신이 될 수 있다는 점을 기억하세요!
    `,
  },
  ISFP: {
    src: `/img/result/ISFP.png`,
    title: '따뜻한 감성의 힐러',
    sub: '거창한 명예보다 소확행이 중요해요.',
    desc: `
    당신을 대표하는 단어는 '소박함'입니다.
    불확실한 미래보다 확실한 현재가 중요한 당신은
    커다란 야심보다 소소한 행복을 더 좋아해요.

    새로운 경험과 자유롭고 여유 있는 삶을 추구하며
    경쟁하는 것보다 편안한 분위기에서 능력을 발휘하죠.
    특히 온화한 성격으로 갈등이나 논쟁을 불편해 해서,
    대체로 좋은 게 좋은 거지 하고 넘어가는 타입!

    곤란한 게 아니라면 남의 부탁을 잘 거절하지 못하고,
    싫은 소리도 잘 못하거나 완곡하게 표현하는 편이라
    화가 나면 참고 참다 조용히 손절하는 게 편하죠.
    이런 면이 순둥이 같지만 또 야무지답니다.
    
    배려와 개인주의적 성향이 공존하는 성격이라서
    혼자 있는 시간, 집에 있는 시간이 꼭 필요해요.
    집에서 아무 것도 안 하고 누워 있는 게 아니라,
    당신의 배려는 때때로 집에서 나온다는 사실!

    `,
  },
  ISTJ: {
    src: `/img/result/ISTJ.png`,
    title: '엘리트 기사단장',
    sub: '자신의 씨앗은 자신이 거둬야 한다.',
    desc: `
    당신을 대표하는 단어는 '책임감'입니다.
    질서와 안정을 중요하게 생각하는 당신은
    철저하게 계획하고, 책임감 있게 일을 끝냅니다.

    매우 현실적인 성격으로 꽤 보수적인 편이며,
    변화보다 안정을 추구하고 외골수 성향이 강해요.
    특히 공감 능력이 낮고 감정 표현이 적어
    자신을 잘 드러내지 않고 딱딱해 보이곤 해요.

    하지만 그 이면엔 강한 책임감이 존재합니다.
    주어진 일을 완벽하게 처리하기 위해서라면,
    기꺼이 희생하고 자신의 피해를 감수합니다.
    또한 올곧은 성격이라 안정감을 주기도 하죠.

    차가워 보이지만 사실 솔직하지 못하고,
    무심해 보이지만 사소한 것들을 잘 기억하는,
    가까운 사람에게 애정 표현보다 잔소리를 하는
    당신은 의외로 귀여운 츤데레 타입 아닐까요!?

    `,
  },
  ISTP: {
    src: `/img/result/ISTP.png`,
    title: '외강내유 대장장이',
    sub: '백 마디 말보다 한 번의 행동이 낫다.',
    desc: `
    당신을 대표하는 단어는 '과묵'입니다.
    마음에 없는 얘기, 관심 없는 가십은 귀찮아요.
    깔끔하게 앞가림만 잘해도 좋다고 생각하죠.

    손재주가 좋거나 야무지다는 평을 듣는 당신은
    어떤 일이든 일단 주어지면 최선을 다합니다.
    재지 않고 하고 보는 것이 당신의 강점이에요.

    의외로 고집이 세고, 독설도 잘하고,
    무표정이 디폴트라 다가가기 어려워 보여요.
    하지만 사실은 관심사에 한해 수다쟁이인데다,
    가까운 사람에겐 정 많고 속 깊은 사람이에요.

    쇠는 두드릴 수록 단단해지는 것처럼,
    우직하게 자신의 일을 해내는 당신의 재주는
    재능이 아니라 노력과 습관의 결실 같네요!

    `,
  },
};

export const MatchData = {
  ENFJ: {
    good: { title: resultData.INFP.title, src: resultData.INFP.src },
    bad: { title: resultData.ESTP.title, src: resultData.ESTP.src },
  },
  ENFP: {
    good: { title: resultData.INFJ.title, src: resultData.INFJ.src },
    bad: { title: resultData.ESFP.title, src: resultData.ESFP.src },
  },
  ENTJ: {
    good: { title: resultData.INTP.title, src: resultData.INTP.src },
    bad: { title: resultData.ISFP.title, src: resultData.ISFP.src },
  },
  ENTP: {
    good: { title: resultData.INFJ.title, src: resultData.INFJ.src },
    bad: { title: resultData.ISFJ.title, src: resultData.ISFJ.src },
  },
  ESFJ: {
    good: { title: resultData.ISTP.title, src: resultData.ISTP.src },
    bad: { title: resultData.INTP.title, src: resultData.INTP.src },
  },
  ESFP: {
    good: { title: resultData.ISTJ.title, src: resultData.ISTJ.src },
    bad: { title: resultData.ENFJ.title, src: resultData.ENFJ.src },
  },
  ESTJ: {
    good: { title: resultData.ISFP.title, src: resultData.ISFP.src },
    bad: { title: resultData.INTJ.title, src: resultData.INTJ.src },
  },
  ESTP: {
    good: { title: resultData.ISFJ.title, src: resultData.ISFJ.src },
    bad: { title: resultData.ENFP.title, src: resultData.ENFP.src },
  },
  INFJ: {
    good: { title: resultData.ENFP.title, src: resultData.ENFP.src },
    bad: { title: resultData.ISTP.title, src: resultData.ISTP.src },
  },
  INFP: {
    good: { title: resultData.ENFJ.title, src: resultData.ENFJ.src },
    bad: { title: resultData.ISTP.title, src: resultData.ISTP.src },
  },
  INTJ: {
    good: { title: resultData.ENFP.title, src: resultData.ENFP.src },
    bad: { title: resultData.INFP.title, src: resultData.INFP.src },
  },
  INTP: {
    good: { title: resultData.ENTJ.title, src: resultData.ENTJ.src },
    bad: { title: resultData.ENFJ.title, src: resultData.ENFJ.src },
  },
  ISFJ: {
    good: { title: resultData.ESFP.title, src: resultData.ESFP.src },
    bad: { title: resultData.INFP.title, src: resultData.INFP.src },
  },
  ISFP: {
    good: { title: resultData.ENFJ.title, src: resultData.ENFJ.src },
    bad: { title: resultData.INFJ.title, src: resultData.INFJ.src },
  },
  ISTJ: {
    good: { title: resultData.ESFP.title, src: resultData.ESFP.src },
    bad: { title: resultData.ENTP.title, src: resultData.ENTP.src },
  },
  ISTP: {
    good: { title: resultData.ESTJ.title, src: resultData.ESTJ.src },
    bad: { title: resultData.INFJ.title, src: resultData.INFJ.src },
  },
};
